hellgheast/uKOS-X/Tools/TestRom/Discovery_N657_Cortex-M55/Includes/SOC/Registers/stm32N657_gpiog.h
// SECCFGR Configuration

#define	GPIOG_SECCFGR_SEC15					(0x1u<<15)
#define	GPIOG_SECCFGR_SEC14					(0x1u<<14)
#define	GPIOG_SECCFGR_SEC13					(0x1u<<13)
#define	GPIOG_SECCFGR_SEC12					(0x1u<<12)
#define	GPIOG_SECCFGR_SEC11					(0x1u<<11)
#define	GPIOG_SECCFGR_SEC10					(0x1u<<10)
#define	GPIOG_SECCFGR_SEC9					(0x1u<<9)
#define	GPIOG_SECCFGR_SEC8					(0x1u<<8)
#define	GPIOG_SECCFGR_SEC7					(0x1u<<7)
#define	GPIOG_SECCFGR_SEC6					(0x1u<<6)
#define	GPIOG_SECCFGR_SEC5					(0x1u<<5)
#define	GPIOG_SECCFGR_SEC4					(0x1u<<4)
#define	GPIOG_SECCFGR_SEC3					(0x1u<<3)
#define	GPIOG_SECCFGR_SEC2					(0x1u<<2)
#define	GPIOG_SECCFGR_SEC1					(0x1u<<1)
#define	GPIOG_SECCFGR_SEC0					(0x1u<<0)

#define	GPIOG_SECCFGR_SEC15_B_0X0			(0x0u<<15)
#define	GPIOG_SECCFGR_SEC15_B_0X1			(0x1u<<15)
#define	GPIOG_SECCFGR_SEC14_B_0X0			(0x0u<<14)
#define	GPIOG_SECCFGR_SEC14_B_0X1			(0x1u<<14)
#define	GPIOG_SECCFGR_SEC13_B_0X0			(0x0u<<13)
#define	GPIOG_SECCFGR_SEC13_B_0X1			(0x1u<<13)
#define	GPIOG_SECCFGR_SEC12_B_0X0			(0x0u<<12)
#define	GPIOG_SECCFGR_SEC12_B_0X1			(0x1u<<12)
#define	GPIOG_SECCFGR_SEC11_B_0X0			(0x0u<<11)
#define	GPIOG_SECCFGR_SEC11_B_0X1			(0x1u<<11)
#define	GPIOG_SECCFGR_SEC10_B_0X0			(0x0u<<10)
#define	GPIOG_SECCFGR_SEC10_B_0X1			(0x1u<<10)
#define	GPIOG_SECCFGR_SEC9_B_0X0			(0x0u<<9)
#define	GPIOG_SECCFGR_SEC9_B_0X1			(0x1u<<9)
#define	GPIOG_SECCFGR_SEC8_B_0X0			(0x0u<<8)
#define	GPIOG_SECCFGR_SEC8_B_0X1			(0x1u<<8)
#define	GPIOG_SECCFGR_SEC7_B_0X0			(0x0u<<7)
#define	GPIOG_SECCFGR_SEC7_B_0X1			(0x1u<<7)
#define	GPIOG_SECCFGR_SEC6_B_0X0			(0x0u<<6)
#define	GPIOG_SECCFGR_SEC6_B_0X1			(0x1u<<6)
#define	GPIOG_SECCFGR_SEC5_B_0X0			(0x0u<<5)
#define	GPIOG_SECCFGR_SEC5_B_0X1			(0x1u<<5)
#define	GPIOG_SECCFGR_SEC4_B_0X0			(0x0u<<4)
#define	GPIOG_SECCFGR_SEC4_B_0X1			(0x1u<<4)
#define	GPIOG_SECCFGR_SEC3_B_0X0			(0x0u<<3)
#define	GPIOG_SECCFGR_SEC3_B_0X1			(0x1u<<3)
#define	GPIOG_SECCFGR_SEC2_B_0X0			(0x0u<<2)
#define	GPIOG_SECCFGR_SEC2_B_0X1			(0x1u<<2)
#define	GPIOG_SECCFGR_SEC1_B_0X0			(0x0u<<1)
#define	GPIOG_SECCFGR_SEC1_B_0X1			(0x1u<<1)
#define	GPIOG_SECCFGR_SEC0_B_0X0			(0x0u<<0)
#define	GPIOG_SECCFGR_SEC0_B_0X1			(0x1u<<0)

// PRIVCFGR Configuration

#define	GPIOG_PRIVCFGR_PRIV15				(0x1u<<15)
#define	GPIOG_PRIVCFGR_PRIV14				(0x1u<<14)
#define	GPIOG_PRIVCFGR_PRIV13				(0x1u<<13)
#define	GPIOG_PRIVCFGR_PRIV12				(0x1u<<12)
#define	GPIOG_PRIVCFGR_PRIV11				(0x1u<<11)
#define	GPIOG_PRIVCFGR_PRIV10				(0x1u<<10)
#define	GPIOG_PRIVCFGR_PRIV9				(0x1u<<9)
#define	GPIOG_PRIVCFGR_PRIV8				(0x1u<<8)
#define	GPIOG_PRIVCFGR_PRIV7				(0x1u<<7)
#define	GPIOG_PRIVCFGR_PRIV6				(0x1u<<6)
#define	GPIOG_PRIVCFGR_PRIV5				(0x1u<<5)
#define	GPIOG_PRIVCFGR_PRIV4				(0x1u<<4)
#define	GPIOG_PRIVCFGR_PRIV3				(0x1u<<3)
#define	GPIOG_PRIVCFGR_PRIV2				(0x1u<<2)
#define	GPIOG_PRIVCFGR_PRIV1				(0x1u<<1)
#define	GPIOG_PRIVCFGR_PRIV0				(0x1u<<0)

#define	GPIOG_PRIVCFGR_PRIV15_B_0X0			(0x0u<<15)
#define	GPIOG_PRIVCFGR_PRIV15_B_0X1			(0x1u<<15)
#define	GPIOG_PRIVCFGR_PRIV14_B_0X0			(0x0u<<14)
#define	GPIOG_PRIVCFGR_PRIV14_B_0X1			(0x1u<<14)
#define	GPIOG_PRIVCFGR_PRIV13_B_0X0			(0x0u<<13)
#define	GPIOG_PRIVCFGR_PRIV13_B_0X1			(0x1u<<13)
#define	GPIOG_PRIVCFGR_PRIV12_B_0X0			(0x0u<<12)
#define	GPIOG_PRIVCFGR_PRIV12_B_0X1			(0x1u<<12)
#define	GPIOG_PRIVCFGR_PRIV11_B_0X0			(0x0u<<11)
#define	GPIOG_PRIVCFGR_PRIV11_B_0X1			(0x1u<<11)
#define	GPIOG_PRIVCFGR_PRIV10_B_0X0			(0x0u<<10)
#define	GPIOG_PRIVCFGR_PRIV10_B_0X1			(0x1u<<10)
#define	GPIOG_PRIVCFGR_PRIV9_B_0X0			(0x0u<<9)
#define	GPIOG_PRIVCFGR_PRIV9_B_0X1			(0x1u<<9)
#define	GPIOG_PRIVCFGR_PRIV8_B_0X0			(0x0u<<8)
#define	GPIOG_PRIVCFGR_PRIV8_B_0X1			(0x1u<<8)
#define	GPIOG_PRIVCFGR_PRIV7_B_0X0			(0x0u<<7)
#define	GPIOG_PRIVCFGR_PRIV7_B_0X1			(0x1u<<7)
#define	GPIOG_PRIVCFGR_PRIV6_B_0X0			(0x0u<<6)
#define	GPIOG_PRIVCFGR_PRIV6_B_0X1			(0x1u<<6)
#define	GPIOG_PRIVCFGR_PRIV5_B_0X0			(0x0u<<5)
#define	GPIOG_PRIVCFGR_PRIV5_B_0X1			(0x1u<<5)
#define	GPIOG_PRIVCFGR_PRIV4_B_0X0			(0x0u<<4)
#define	GPIOG_PRIVCFGR_PRIV4_B_0X1			(0x1u<<4)
#define	GPIOG_PRIVCFGR_PRIV3_B_0X0			(0x0u<<3)
#define	GPIOG_PRIVCFGR_PRIV3_B_0X1			(0x1u<<3)
#define	GPIOG_PRIVCFGR_PRIV2_B_0X0			(0x0u<<2)
#define	GPIOG_PRIVCFGR_PRIV2_B_0X1			(0x1u<<2)
#define	GPIOG_PRIVCFGR_PRIV1_B_0X0			(0x0u<<1)
#define	GPIOG_PRIVCFGR_PRIV1_B_0X1			(0x1u<<1)
#define	GPIOG_PRIVCFGR_PRIV0_B_0X0			(0x0u<<0)
#define	GPIOG_PRIVCFGR_PRIV0_B_0X1			(0x1u<<0)

// RCFGLOCKR Configuration

#define	GPIOG_RCFGLOCKR_RLOCK15				(0x1u<<15)
#define	GPIOG_RCFGLOCKR_RLOCK14				(0x1u<<14)
#define	GPIOG_RCFGLOCKR_RLOCK13				(0x1u<<13)
#define	GPIOG_RCFGLOCKR_RLOCK12				(0x1u<<12)
#define	GPIOG_RCFGLOCKR_RLOCK11				(0x1u<<11)
#define	GPIOG_RCFGLOCKR_RLOCK10				(0x1u<<10)
#define	GPIOG_RCFGLOCKR_RLOCK9				(0x1u<<9)
#define	GPIOG_RCFGLOCKR_RLOCK8				(0x1u<<8)
#define	GPIOG_RCFGLOCKR_RLOCK7				(0x1u<<7)
#define	GPIOG_RCFGLOCKR_RLOCK6				(0x1u<<6)
#define	GPIOG_RCFGLOCKR_RLOCK5				(0x1u<<5)
#define	GPIOG_RCFGLOCKR_RLOCK4				(0x1u<<4)
#define	GPIOG_RCFGLOCKR_RLOCK3				(0x1u<<3)
#define	GPIOG_RCFGLOCKR_RLOCK2				(0x1u<<2)
#define	GPIOG_RCFGLOCKR_RLOCK1				(0x1u<<1)
#define	GPIOG_RCFGLOCKR_RLOCK0				(0x1u<<0)

#define	GPIOG_RCFGLOCKR_RLOCK15_B_0X0		(0x0u<<15)
#define	GPIOG_RCFGLOCKR_RLOCK15_B_0X1		(0x1u<<15)
#define	GPIOG_RCFGLOCKR_RLOCK14_B_0X0		(0x0u<<14)
#define	GPIOG_RCFGLOCKR_RLOCK14_B_0X1		(0x1u<<14)
#define	GPIOG_RCFGLOCKR_RLOCK13_B_0X0		(0x0u<<13)
#define	GPIOG_RCFGLOCKR_RLOCK13_B_0X1		(0x1u<<13)
#define	GPIOG_RCFGLOCKR_RLOCK12_B_0X0		(0x0u<<12)
#define	GPIOG_RCFGLOCKR_RLOCK12_B_0X1		(0x1u<<12)
#define	GPIOG_RCFGLOCKR_RLOCK11_B_0X0		(0x0u<<11)
#define	GPIOG_RCFGLOCKR_RLOCK11_B_0X1		(0x1u<<11)
#define	GPIOG_RCFGLOCKR_RLOCK10_B_0X0		(0x0u<<10)
#define	GPIOG_RCFGLOCKR_RLOCK10_B_0X1		(0x1u<<10)
#define	GPIOG_RCFGLOCKR_RLOCK9_B_0X0		(0x0u<<9)
#define	GPIOG_RCFGLOCKR_RLOCK9_B_0X1		(0x1u<<9)
#define	GPIOG_RCFGLOCKR_RLOCK8_B_0X0		(0x0u<<8)
#define	GPIOG_RCFGLOCKR_RLOCK8_B_0X1		(0x1u<<8)
#define	GPIOG_RCFGLOCKR_RLOCK7_B_0X0		(0x0u<<7)
#define	GPIOG_RCFGLOCKR_RLOCK7_B_0X1		(0x1u<<7)
#define	GPIOG_RCFGLOCKR_RLOCK6_B_0X0		(0x0u<<6)
#define	GPIOG_RCFGLOCKR_RLOCK6_B_0X1		(0x1u<<6)
#define	GPIOG_RCFGLOCKR_RLOCK5_B_0X0		(0x0u<<5)
#define	GPIOG_RCFGLOCKR_RLOCK5_B_0X1		(0x1u<<5)
#define	GPIOG_RCFGLOCKR_RLOCK4_B_0X0		(0x0u<<4)
#define	GPIOG_RCFGLOCKR_RLOCK4_B_0X1		(0x1u<<4)
#define	GPIOG_RCFGLOCKR_RLOCK3_B_0X0		(0x0u<<3)
#define	GPIOG_RCFGLOCKR_RLOCK3_B_0X1		(0x1u<<3)
#define	GPIOG_RCFGLOCKR_RLOCK2_B_0X0		(0x0u<<2)
#define	GPIOG_RCFGLOCKR_RLOCK2_B_0X1		(0x1u<<2)
#define	GPIOG_RCFGLOCKR_RLOCK1_B_0X0		(0x0u<<1)
#define	GPIOG_RCFGLOCKR_RLOCK1_B_0X1		(0x1u<<1)
#define	GPIOG_RCFGLOCKR_RLOCK0_B_0X0		(0x0u<<0)
#define	GPIOG_RCFGLOCKR_RLOCK0_B_0X1		(0x1u<<0)

// DELAYRL Configuration

